Revit 2026 API

# DirectShapeGetExternallyTaggedGeometry Method

---

Gets the externally tagged geometry by its external ID that is stored in this DirectShape.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExternallyTaggedGeometryObject GetExternallyTaggedGeometry(
	ExternalGeometryId externalId
)
```
```vb
Public Function GetExternallyTaggedGeometry (
	externalId As ExternalGeometryId
) As ExternallyTaggedGeometryObject
```
```cpp
public:
ExternallyTaggedGeometryObject^ GetExternallyTaggedGeometry(
	ExternalGeometryId^ externalId
)
```
```fsharp
member GetExternallyTaggedGeometry :
        externalId : ExternalGeometryId -> ExternallyTaggedGeometryObject
```

#### Parameters

externalId ExternalGeometryId
     The external ID of the externally tagged geometry that should be obtained.

#### Return Value

ExternallyTaggedGeometryObject The externally tagged geometry. Or  if there is no such externally tagged geometry in the DirectShape.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DirectShape Class

Autodesk.Revit.DB Namespace